/**
 * Хипуй!
 * В этой задаче вам необходимо организовать структуру данных Heap для хранения целых чисел, над которой определены следующие операции:
 * Insert(X) - добавить в HeapX;
 * Exctract - достать из Heap наибольшее число (удалив его при этом).
 *
 * Входные данные
 * Во входном файле записано количество команд N (1 ≤ N≤ 100000), потом последовательность из N команд, каждая в своей строке.
 * Каждая команда имеет такой формат: "0 <число>" или "1", что означает соответственно операции Insert (<число>) и Extract. Добавляемые числа находятся в интервале от 1 до 107 включительно.
 * Гарантируется, что при выполнении команды Extract в структуре находится по крайней мере 1 элемент.
 *
 * Выходные данные
 * В выходной файл для каждой команды извлечения необходимо вывести число, полученное при выполнении команды Extract.
 */
public class Task4039 {
    public static void main(String[] args) {
    }
}