/**
 * Куча ли?
 * Структуру данных Heap можно реализовать на основе массива.
 * Для этого должно выполняться основное свойство Heapa, которое заключается в следующем. Для каждого i (1 ≤ i ≤ n) выполняются следующие условия:
 * Если 2i ≤ n, то ai ≤ a2i
 * Если 2i + 1 ≤ n, то ai ≤ a2i+1
 * Дан массив целых чисел. Определите является ли он Heapом.
 *
 * Входные данные
 * Первая строка содержит целое число n (1 ≤ n ≤ 105). Вторая строка содержит n целых чисел, не превосходящих по модулю 2·109.
 *
 * Выходные данные
 * Выведите "YES", если массив является Heapом и "NO" в противном случае.
 */
public class Task3737 {
    public static void main(String[] args) {
    }
}